sebastianmurf/Innovatek_PCB_5.0_001/PCB 5.0 FW/common/mb9a310k.h
/* Deep standby control registers */
#define bFM3_DS_PMD_CTL_RTCE                   *((volatile unsigned int*)(0x426B0000UL))
#define bFM3_DS_WRFSR_WINITX                   *((volatile unsigned int*)(0x426B0080UL))
#define bFM3_DS_WRFSR_WLVDH                    *((volatile unsigned int*)(0x426B0084UL))
#define bFM3_DS_WIFSR_WRTCI                    *((volatile unsigned int*)(0x426B0100UL))
#define bFM3_DS_WIFSR_WLVDI                    *((volatile unsigned int*)(0x426B0104UL))
#define bFM3_DS_WIFSR_WUI0                     *((volatile unsigned int*)(0x426B0108UL))
#define bFM3_DS_WIFSR_WUI1                     *((volatile unsigned int*)(0x426B010CUL))
#define bFM3_DS_WIFSR_WUI2                     *((volatile unsigned int*)(0x426B0110UL))
#define bFM3_DS_WIFSR_WUI3                     *((volatile unsigned int*)(0x426B0114UL))
#define bFM3_DS_WIER_WRTCE                     *((volatile unsigned int*)(0x426B0180UL))
#define bFM3_DS_WIER_WLVDE                     *((volatile unsigned int*)(0x426B0184UL))
#define bFM3_DS_WIER_WUI1E                     *((volatile unsigned int*)(0x426B018CUL))
#define bFM3_DS_WIER_WUI2E                     *((volatile unsigned int*)(0x426B0190UL))
#define bFM3_DS_WIER_WUI3E                     *((volatile unsigned int*)(0x426B0194UL))
#define bFM3_DS_WILVR_WUI1LV                   *((volatile unsigned int*)(0x426B0200UL))
#define bFM3_DS_WILVR_WUI2LV                   *((volatile unsigned int*)(0x426B0204UL))
#define bFM3_DS_WILVR_WUI3LV                   *((volatile unsigned int*)(0x426B0208UL))
#define bFM3_DS_DSRAMR_SRAM0                   *((volatile unsigned int*)(0x426B0280UL))
#define bFM3_DS_DSRAMR_SRAM1                   *((volatile unsigned int*)(0x426B0284UL))

/* USB clock registers */
#define bFM3_USBCLK_UCCR_UCEN                  *((volatile unsigned int*)(0x426C0000UL))
#define bFM3_USBCLK_UCCR_UCSEL                 *((volatile unsigned int*)(0x426C0004UL))
#define bFM3_USBCLK_UPCR1_UPLLEN               *((volatile unsigned int*)(0x426C0080UL))
#define bFM3_USBCLK_UPCR1_UPINC                *((volatile unsigned int*)(0x426C0084UL))
#define bFM3_USBCLK_UPCR2_UPOWT0               *((volatile unsigned int*)(0x426C0100UL))
#define bFM3_USBCLK_UPCR2_UPOWT1               *((volatile unsigned int*)(0x426C0104UL))
#define bFM3_USBCLK_UPCR2_UPOWT2               *((volatile unsigned int*)(0x426C0108UL))
#define bFM3_USBCLK_UPCR3_UPLLK0               *((volatile unsigned int*)(0x426C0180UL))
#define bFM3_USBCLK_UPCR3_UPLLK1               *((volatile unsigned int*)(0x426C0184UL))
#define bFM3_USBCLK_UPCR3_UPLLK2               *((volatile unsigned int*)(0x426C0188UL))
#define bFM3_USBCLK_UPCR3_UPLLK3               *((volatile unsigned int*)(0x426C018CUL))
#define bFM3_USBCLK_UPCR3_UPLLK4               *((volatile unsigned int*)(0x426C0190UL))
#define bFM3_USBCLK_UPCR4_UPLLN0               *((volatile unsigned int*)(0x426C0200UL))
#define bFM3_USBCLK_UPCR4_UPLLN1               *((volatile unsigned int*)(0x426C0204UL))
#define bFM3_USBCLK_UPCR4_UPLLN2               *((volatile unsigned int*)(0x426C0208UL))
#define bFM3_USBCLK_UPCR4_UPLLN3               *((volatile unsigned int*)(0x426C020CUL))
#define bFM3_USBCLK_UPCR4_UPLLN4               *((volatile unsigned int*)(0x426C0210UL))
#define bFM3_USBCLK_UPCR4_UPLLN5               *((volatile unsigned int*)(0x426C0214UL))
#define bFM3_USBCLK_UPCR4_UPLLN6               *((volatile unsigned int*)(0x426C0218UL))
#define bFM3_USBCLK_UP_STR_UPRDY               *((volatile unsigned int*)(0x426C0280UL))
#define bFM3_USBCLK_UPINT_ENR_UPCSE            *((volatile unsigned int*)(0x426C0300UL))
#define bFM3_USBCLK_UPINT_CLR_UPCSC            *((volatile unsigned int*)(0x426C0380UL))
#define bFM3_USBCLK_UPINT_STR_UPCSI            *((volatile unsigned int*)(0x426C0400UL))
#define bFM3_USBCLK_UPCR5_UPLLM0               *((volatile unsigned int*)(0x426C0480UL))
#define bFM3_USBCLK_UPCR5_UPLLM1               *((volatile unsigned int*)(0x426C0484UL))
#define bFM3_USBCLK_UPCR5_UPLLM2               *((volatile unsigned int*)(0x426C0488UL))
#define bFM3_USBCLK_UPCR5_UPLLM3               *((volatile unsigned int*)(0x426C048CUL))
#define bFM3_USBCLK_USBEN_USBEN                *((volatile unsigned int*)(0x426C0600UL))

/* UART asynchronous channel 0 registers */
#define bFM3_MFS0_UART_SMR_SOE                 *((volatile unsigned int*)(0x42700000UL))
#define bFM3_MFS0_UART_SMR_BDS                 *((volatile unsigned int*)(0x42700008UL))
#define bFM3_MFS0_UART_SMR_SBL                 *((volatile unsigned int*)(0x4270000CUL))
#define bFM3_MFS0_UART_SMR_WUCR                *((volatile unsigned int*)(0x42700010UL))
#define bFM3_MFS0_UART_SCR_TXE                 *((volatile unsigned int*)(0x42700020UL))
#define bFM3_MFS0_UART_SCR_RXE                 *((volatile unsigned int*)(0x42700024UL))
#define bFM3_MFS0_UART_SCR_TBIE                *((volatile unsigned int*)(0x42700028UL))
#define bFM3_MFS0_UART_SCR_TIE                 *((volatile unsigned int*)(0x4270002CUL))
#define bFM3_MFS0_UART_SCR_RIE                 *((volatile unsigned int*)(0x42700030UL))
#define bFM3_MFS0_UART_SCR_UPCL                *((volatile unsigned int*)(0x4270003CUL))
#define bFM3_MFS0_UART_ESCR_L0                 *((volatile unsigned int*)(0x42700080UL))
#define bFM3_MFS0_UART_ESCR_L1                 *((volatile unsigned int*)(0x42700084UL))
#define bFM3_MFS0_UART_ESCR_L2                 *((volatile unsigned int*)(0x42700088UL))
#define bFM3_MFS0_UART_ESCR_P                  *((volatile unsigned int*)(0x4270008CUL))
#define bFM3_MFS0_UART_ESCR_PEN                *((volatile unsigned int*)(0x42700090UL))
#define bFM3_MFS0_UART_ESCR_INV                *((volatile unsigned int*)(0x42700094UL))
#define bFM3_MFS0_UART_ESCR_ESBL               *((volatile unsigned int*)(0x42700098UL))
#define bFM3_MFS0_UART_ESCR_FLWEN              *((volatile unsigned int*)(0x4270009CUL))
#define bFM3_MFS0_UART_SSR_TBI                 *((volatile unsigned int*)(0x427000A0UL))
#define bFM3_MFS0_UART_SSR_TDRE                *((volatile unsigned int*)(0x427000A4UL))
#define bFM3_MFS0_UART_SSR_RDRF                *((volatile unsigned int*)(0x427000A8UL))
#define bFM3_MFS0_UART_SSR_ORE                 *((volatile unsigned int*)(0x427000ACUL))
#define bFM3_MFS0_UART_SSR_FRE                 *((volatile unsigned int*)(0x427000B0UL))
#define bFM3_MFS0_UART_SSR_PE                  *((volatile unsigned int*)(0x427000B4UL))
#define bFM3_MFS0_UART_SSR_REC                 *((volatile unsigned int*)(0x427000BCUL))
#define bFM3_MFS0_UART_RDR_AD                  *((volatile unsigned int*)(0x42700120UL))
#define bFM3_MFS0_UART_TDR_AD                  *((volatile unsigned int*)(0x42700120UL))
#define bFM3_MFS0_UART_BGR_EXT                 *((volatile unsigned int*)(0x427001BCUL))
#define bFM3_MFS0_UART_BGR1_EXT                *((volatile unsigned int*)(0x427001BCUL))
#define bFM3_MFS0_UART_FCR_FE1                 *((volatile unsigned int*)(0x42700280UL))
#define bFM3_MFS0_UART_FCR_FE2                 *((volatile unsigned int*)(0x42700284UL))
#define bFM3_MFS0_UART_FCR_FCL1                *((volatile unsigned int*)(0x42700288UL))
#define bFM3_MFS0_UART_FCR_FCL2                *((volatile unsigned int*)(0x4270028CUL))
#define bFM3_MFS0_UART_FCR_FSET                *((volatile unsigned int*)(0x42700290UL))
#define bFM3_MFS0_UART_FCR_FLD                 *((volatile unsigned int*)(0x42700294UL))
#define bFM3_MFS0_UART_FCR_FLST                *((volatile unsigned int*)(0x42700298UL))
#define bFM3_MFS0_UART_FCR_FSEL                *((volatile unsigned int*)(0x427002A0UL))
#define bFM3_MFS0_UART_FCR_FTIE                *((volatile unsigned int*)(0x427002A4UL))
#define bFM3_MFS0_UART_FCR_FDRQ                *((volatile unsigned int*)(0x427002A8UL))
#define bFM3_MFS0_UART_FCR_FRIE                *((volatile unsigned int*)(0x427002ACUL))
#define bFM3_MFS0_UART_FCR_FLSTE               *((volatile unsigned int*)(0x427002B0UL))
#define bFM3_MFS0_UART_FCR0_FE1                *((volatile unsigned int*)(0x42700280UL))
#define bFM3_MFS0_UART_FCR0_FE2                *((volatile unsigned int*)(0x42700284UL))
#define bFM3_MFS0_UART_FCR0_FCL1               *((volatile unsigned int*)(0x42700288UL))
#define bFM3_MFS0_UART_FCR0_FCL2               *((volatile unsigned int*)(0x4270028CUL))
#define bFM3_MFS0_UART_FCR0_FSET               *((volatile unsigned int*)(0x42700290UL))
#define bFM3_MFS0_UART_FCR0_FLD                *((volatile unsigned int*)(0x42700294UL))
#define bFM3_MFS0_UART_FCR0_FLST               *((volatile unsigned int*)(0x42700298UL))
#define bFM3_MFS0_UART_FCR1_FSEL               *((volatile unsigned int*)(0x427002A0UL))
#define bFM3_MFS0_UART_FCR1_FTIE               *((volatile unsigned int*)(0x427002A4UL))
#define bFM3_MFS0_UART_FCR1_FDRQ               *((volatile unsigned int*)(0x427002A8UL))
#define bFM3_MFS0_UART_FCR1_FRIE               *((volatile unsigned int*)(0x427002ACUL))
#define bFM3_MFS0_UART_FCR1_FLSTE              *((volatile unsigned int*)(0x427002B0UL))
#define bFM3_MFS0_UART_FBYTE_FD0               *((volatile unsigned int*)(0x42700300UL))
#define bFM3_MFS0_UART_FBYTE_FD1               *((volatile unsigned int*)(0x42700304UL))
#define bFM3_MFS0_UART_FBYTE_FD2               *((volatile unsigned int*)(0x42700308UL))
#define bFM3_MFS0_UART_FBYTE_FD3               *((volatile unsigned int*)(0x4270030CUL))
#define bFM3_MFS0_UART_FBYTE_FD4               *((volatile unsigned int*)(0x42700310UL))
#define bFM3_MFS0_UART_FBYTE_FD5               *((volatile unsigned int*)(0x42700314UL))
#define bFM3_MFS0_UART_FBYTE_FD6               *((volatile unsigned int*)(0x42700318UL))
#define bFM3_MFS0_UART_FBYTE_FD7               *((volatile unsigned int*)(0x4270031CUL))
#define bFM3_MFS0_UART_FBYTE_FD8               *((volatile unsigned int*)(0x42700320UL))
#define bFM3_MFS0_UART_FBYTE_FD9               *((volatile unsigned int*)(0x42700324UL))
#define bFM3_MFS0_UART_FBYTE_FD10              *((volatile unsigned int*)(0x42700328UL))
#define bFM3_MFS0_UART_FBYTE_FD11              *((volatile unsigned int*)(0x4270032CUL))
#define bFM3_MFS0_UART_FBYTE_FD12              *((volatile unsigned int*)(0x42700330UL))
#define bFM3_MFS0_UART_FBYTE_FD13              *((volatile unsigned int*)(0x42700334UL))
#define bFM3_MFS0_UART_FBYTE_FD14              *((volatile unsigned int*)(0x42700338UL))
#define bFM3_MFS0_UART_FBYTE_FD15              *((volatile unsigned int*)(0x4270033CUL))
#define bFM3_MFS0_UART_FBYTE1_FD0              *((volatile unsigned int*)(0x42700300UL))
#define bFM3_MFS0_UART_FBYTE1_FD1              *((volatile unsigned int*)(0x42700304UL))
#define bFM3_MFS0_UART_FBYTE1_FD2              *((volatile unsigned int*)(0x42700308UL))
#define bFM3_MFS0_UART_FBYTE1_FD3              *((volatile unsigned int*)(0x4270030CUL))
#define bFM3_MFS0_UART_FBYTE1_FD4              *((volatile unsigned int*)(0x42700310UL))
#define bFM3_MFS0_UART_FBYTE1_FD5              *((volatile unsigned int*)(0x42700314UL))
#define bFM3_MFS0_UART_FBYTE1_FD6              *((volatile unsigned int*)(0x42700318UL))
#define bFM3_MFS0_UART_FBYTE1_FD7              *((volatile unsigned int*)(0x4270031CUL))
#define bFM3_MFS0_UART_FBYTE2_FD8              *((volatile unsigned int*)(0x42700320UL))
#define bFM3_MFS0_UART_FBYTE2_FD9              *((volatile unsigned int*)(0x42700324UL))
#define bFM3_MFS0_UART_FBYTE2_FD10             *((volatile unsigned int*)(0x42700328UL))
#define bFM3_MFS0_UART_FBYTE2_FD11             *((volatile unsigned int*)(0x4270032CUL))
#define bFM3_MFS0_UART_FBYTE2_FD12             *((volatile unsigned int*)(0x42700330UL))
#define bFM3_MFS0_UART_FBYTE2_FD13             *((volatile unsigned int*)(0x42700334UL))
#define bFM3_MFS0_UART_FBYTE2_FD14             *((volatile unsigned int*)(0x42700338UL))
#define bFM3_MFS0_UART_FBYTE2_FD15             *((volatile unsigned int*)(0x4270033CUL))

