sebastianmurf/Innovatek_PCB_5.0_001/PCB 5.0 FW/common/mb9a310k.h
/* UART synchronous channel 0 registers */
#define bFM3_MFS0_CSIO_SMR_SOE                 *((volatile unsigned int*)(0x42700000UL))
#define bFM3_MFS0_CSIO_SMR_SCKE                *((volatile unsigned int*)(0x42700004UL))
#define bFM3_MFS0_CSIO_SMR_BDS                 *((volatile unsigned int*)(0x42700008UL))
#define bFM3_MFS0_CSIO_SMR_SCINV               *((volatile unsigned int*)(0x4270000CUL))
#define bFM3_MFS0_CSIO_SMR_WUCR                *((volatile unsigned int*)(0x42700010UL))
#define bFM3_MFS0_CSIO_SCR_TXE                 *((volatile unsigned int*)(0x42700020UL))
#define bFM3_MFS0_CSIO_SCR_RXE                 *((volatile unsigned int*)(0x42700024UL))
#define bFM3_MFS0_CSIO_SCR_TBIE                *((volatile unsigned int*)(0x42700028UL))
#define bFM3_MFS0_CSIO_SCR_TIE                 *((volatile unsigned int*)(0x4270002CUL))
#define bFM3_MFS0_CSIO_SCR_RIE                 *((volatile unsigned int*)(0x42700030UL))
#define bFM3_MFS0_CSIO_SCR_SPI                 *((volatile unsigned int*)(0x42700034UL))
#define bFM3_MFS0_CSIO_SCR_MS                  *((volatile unsigned int*)(0x42700038UL))
#define bFM3_MFS0_CSIO_SCR_UPCL                *((volatile unsigned int*)(0x4270003CUL))
#define bFM3_MFS0_CSIO_ESCR_L0                 *((volatile unsigned int*)(0x42700080UL))
#define bFM3_MFS0_CSIO_ESCR_L1                 *((volatile unsigned int*)(0x42700084UL))
#define bFM3_MFS0_CSIO_ESCR_L2                 *((volatile unsigned int*)(0x42700088UL))
#define bFM3_MFS0_CSIO_ESCR_WT0                *((volatile unsigned int*)(0x4270008CUL))
#define bFM3_MFS0_CSIO_ESCR_WT1                *((volatile unsigned int*)(0x42700090UL))
#define bFM3_MFS0_CSIO_ESCR_SOP                *((volatile unsigned int*)(0x4270009CUL))
#define bFM3_MFS0_CSIO_SSR_TBI                 *((volatile unsigned int*)(0x427000A0UL))
#define bFM3_MFS0_CSIO_SSR_TDRE                *((volatile unsigned int*)(0x427000A4UL))
#define bFM3_MFS0_CSIO_SSR_RDRF                *((volatile unsigned int*)(0x427000A8UL))
#define bFM3_MFS0_CSIO_SSR_ORE                 *((volatile unsigned int*)(0x427000ACUL))
#define bFM3_MFS0_CSIO_SSR_REC                 *((volatile unsigned int*)(0x427000BCUL))
#define bFM3_MFS0_CSIO_FCR_FE1                 *((volatile unsigned int*)(0x42700280UL))
#define bFM3_MFS0_CSIO_FCR_FE2                 *((volatile unsigned int*)(0x42700284UL))
#define bFM3_MFS0_CSIO_FCR_FCL1                *((volatile unsigned int*)(0x42700288UL))
#define bFM3_MFS0_CSIO_FCR_FCL2                *((volatile unsigned int*)(0x4270028CUL))
#define bFM3_MFS0_CSIO_FCR_FSET                *((volatile unsigned int*)(0x42700290UL))
#define bFM3_MFS0_CSIO_FCR_FLD                 *((volatile unsigned int*)(0x42700294UL))
#define bFM3_MFS0_CSIO_FCR_FLST                *((volatile unsigned int*)(0x42700298UL))
#define bFM3_MFS0_CSIO_FCR_FSEL                *((volatile unsigned int*)(0x427002A0UL))
#define bFM3_MFS0_CSIO_FCR_FTIE                *((volatile unsigned int*)(0x427002A4UL))
#define bFM3_MFS0_CSIO_FCR_FDRQ                *((volatile unsigned int*)(0x427002A8UL))
#define bFM3_MFS0_CSIO_FCR_FRIE                *((volatile unsigned int*)(0x427002ACUL))
#define bFM3_MFS0_CSIO_FCR_FLSTE               *((volatile unsigned int*)(0x427002B0UL))
#define bFM3_MFS0_CSIO_FCR0_FE1                *((volatile unsigned int*)(0x42700280UL))
#define bFM3_MFS0_CSIO_FCR0_FE2                *((volatile unsigned int*)(0x42700284UL))
#define bFM3_MFS0_CSIO_FCR0_FCL1               *((volatile unsigned int*)(0x42700288UL))
#define bFM3_MFS0_CSIO_FCR0_FCL2               *((volatile unsigned int*)(0x4270028CUL))
#define bFM3_MFS0_CSIO_FCR0_FSET               *((volatile unsigned int*)(0x42700290UL))
#define bFM3_MFS0_CSIO_FCR0_FLD                *((volatile unsigned int*)(0x42700294UL))
#define bFM3_MFS0_CSIO_FCR0_FLST               *((volatile unsigned int*)(0x42700298UL))
#define bFM3_MFS0_CSIO_FCR1_FSEL               *((volatile unsigned int*)(0x427002A0UL))
#define bFM3_MFS0_CSIO_FCR1_FTIE               *((volatile unsigned int*)(0x427002A4UL))
#define bFM3_MFS0_CSIO_FCR1_FDRQ               *((volatile unsigned int*)(0x427002A8UL))
#define bFM3_MFS0_CSIO_FCR1_FRIE               *((volatile unsigned int*)(0x427002ACUL))
#define bFM3_MFS0_CSIO_FCR1_FLSTE              *((volatile unsigned int*)(0x427002B0UL))
#define bFM3_MFS0_CSIO_FBYTE_FD0               *((volatile unsigned int*)(0x42700300UL))
#define bFM3_MFS0_CSIO_FBYTE_FD1               *((volatile unsigned int*)(0x42700304UL))
#define bFM3_MFS0_CSIO_FBYTE_FD2               *((volatile unsigned int*)(0x42700308UL))
#define bFM3_MFS0_CSIO_FBYTE_FD3               *((volatile unsigned int*)(0x4270030CUL))
#define bFM3_MFS0_CSIO_FBYTE_FD4               *((volatile unsigned int*)(0x42700310UL))
#define bFM3_MFS0_CSIO_FBYTE_FD5               *((volatile unsigned int*)(0x42700314UL))
#define bFM3_MFS0_CSIO_FBYTE_FD6               *((volatile unsigned int*)(0x42700318UL))
#define bFM3_MFS0_CSIO_FBYTE_FD7               *((volatile unsigned int*)(0x4270031CUL))
#define bFM3_MFS0_CSIO_FBYTE_FD8               *((volatile unsigned int*)(0x42700320UL))
#define bFM3_MFS0_CSIO_FBYTE_FD9               *((volatile unsigned int*)(0x42700324UL))
#define bFM3_MFS0_CSIO_FBYTE_FD10              *((volatile unsigned int*)(0x42700328UL))
#define bFM3_MFS0_CSIO_FBYTE_FD11              *((volatile unsigned int*)(0x4270032CUL))
#define bFM3_MFS0_CSIO_FBYTE_FD12              *((volatile unsigned int*)(0x42700330UL))
#define bFM3_MFS0_CSIO_FBYTE_FD13              *((volatile unsigned int*)(0x42700334UL))
#define bFM3_MFS0_CSIO_FBYTE_FD14              *((volatile unsigned int*)(0x42700338UL))
#define bFM3_MFS0_CSIO_FBYTE_FD15              *((volatile unsigned int*)(0x4270033CUL))
#define bFM3_MFS0_CSIO_FBYTE1_FD0              *((volatile unsigned int*)(0x42700300UL))
#define bFM3_MFS0_CSIO_FBYTE1_FD1              *((volatile unsigned int*)(0x42700304UL))
#define bFM3_MFS0_CSIO_FBYTE1_FD2              *((volatile unsigned int*)(0x42700308UL))
#define bFM3_MFS0_CSIO_FBYTE1_FD3              *((volatile unsigned int*)(0x4270030CUL))
#define bFM3_MFS0_CSIO_FBYTE1_FD4              *((volatile unsigned int*)(0x42700310UL))
#define bFM3_MFS0_CSIO_FBYTE1_FD5              *((volatile unsigned int*)(0x42700314UL))
#define bFM3_MFS0_CSIO_FBYTE1_FD6              *((volatile unsigned int*)(0x42700318UL))
#define bFM3_MFS0_CSIO_FBYTE1_FD7              *((volatile unsigned int*)(0x4270031CUL))
#define bFM3_MFS0_CSIO_FBYTE2_FD8              *((volatile unsigned int*)(0x42700320UL))
#define bFM3_MFS0_CSIO_FBYTE2_FD9              *((volatile unsigned int*)(0x42700324UL))
#define bFM3_MFS0_CSIO_FBYTE2_FD10             *((volatile unsigned int*)(0x42700328UL))
#define bFM3_MFS0_CSIO_FBYTE2_FD11             *((volatile unsigned int*)(0x4270032CUL))
#define bFM3_MFS0_CSIO_FBYTE2_FD12             *((volatile unsigned int*)(0x42700330UL))
#define bFM3_MFS0_CSIO_FBYTE2_FD13             *((volatile unsigned int*)(0x42700334UL))
#define bFM3_MFS0_CSIO_FBYTE2_FD14             *((volatile unsigned int*)(0x42700338UL))
#define bFM3_MFS0_CSIO_FBYTE2_FD15             *((volatile unsigned int*)(0x4270033CUL))

/* UART LIN channel 0 registers */
#define bFM3_MFS0_LIN_SMR_SOE                  *((volatile unsigned int*)(0x42700000UL))
#define bFM3_MFS0_LIN_SMR_SBL                  *((volatile unsigned int*)(0x4270000CUL))
#define bFM3_MFS0_LIN_SMR_WUCR                 *((volatile unsigned int*)(0x42700010UL))
#define bFM3_MFS0_LIN_SCR_TXE                  *((volatile unsigned int*)(0x42700020UL))
#define bFM3_MFS0_LIN_SCR_RXE                  *((volatile unsigned int*)(0x42700024UL))
#define bFM3_MFS0_LIN_SCR_TBIE                 *((volatile unsigned int*)(0x42700028UL))
#define bFM3_MFS0_LIN_SCR_TIE                  *((volatile unsigned int*)(0x4270002CUL))
#define bFM3_MFS0_LIN_SCR_RIE                  *((volatile unsigned int*)(0x42700030UL))
#define bFM3_MFS0_LIN_SCR_LBR                  *((volatile unsigned int*)(0x42700034UL))
#define bFM3_MFS0_LIN_SCR_MS                   *((volatile unsigned int*)(0x42700038UL))
#define bFM3_MFS0_LIN_SCR_UPCL                 *((volatile unsigned int*)(0x4270003CUL))
#define bFM3_MFS0_LIN_ESCR_DEL0                *((volatile unsigned int*)(0x42700080UL))
#define bFM3_MFS0_LIN_ESCR_DEL1                *((volatile unsigned int*)(0x42700084UL))
#define bFM3_MFS0_LIN_ESCR_LBL0                *((volatile unsigned int*)(0x42700088UL))
#define bFM3_MFS0_LIN_ESCR_LBL1                *((volatile unsigned int*)(0x4270008CUL))
#define bFM3_MFS0_LIN_ESCR_LBIE                *((volatile unsigned int*)(0x42700090UL))
#define bFM3_MFS0_LIN_ESCR_ESBL                *((volatile unsigned int*)(0x42700098UL))
#define bFM3_MFS0_LIN_SSR_TBI                  *((volatile unsigned int*)(0x427000A0UL))
#define bFM3_MFS0_LIN_SSR_TDRE                 *((volatile unsigned int*)(0x427000A4UL))
#define bFM3_MFS0_LIN_SSR_RDRF                 *((volatile unsigned int*)(0x427000A8UL))
#define bFM3_MFS0_LIN_SSR_ORE                  *((volatile unsigned int*)(0x427000ACUL))
#define bFM3_MFS0_LIN_SSR_FRE                  *((volatile unsigned int*)(0x427000B0UL))
#define bFM3_MFS0_LIN_SSR_LBD                  *((volatile unsigned int*)(0x427000B4UL))
#define bFM3_MFS0_LIN_SSR_REC                  *((volatile unsigned int*)(0x427000BCUL))
#define bFM3_MFS0_LIN_BGR_EXT                  *((volatile unsigned int*)(0x427001BCUL))
#define bFM3_MFS0_LIN_BGR1_EXT                 *((volatile unsigned int*)(0x427001BCUL))
#define bFM3_MFS0_LIN_FCR_FE1                  *((volatile unsigned int*)(0x42700280UL))
#define bFM3_MFS0_LIN_FCR_FE2                  *((volatile unsigned int*)(0x42700284UL))
#define bFM3_MFS0_LIN_FCR_FCL1                 *((volatile unsigned int*)(0x42700288UL))
#define bFM3_MFS0_LIN_FCR_FCL2                 *((volatile unsigned int*)(0x4270028CUL))
#define bFM3_MFS0_LIN_FCR_FSET                 *((volatile unsigned int*)(0x42700290UL))
#define bFM3_MFS0_LIN_FCR_FLD                  *((volatile unsigned int*)(0x42700294UL))
#define bFM3_MFS0_LIN_FCR_FLST                 *((volatile unsigned int*)(0x42700298UL))
#define bFM3_MFS0_LIN_FCR_FSEL                 *((volatile unsigned int*)(0x427002A0UL))
#define bFM3_MFS0_LIN_FCR_FTIE                 *((volatile unsigned int*)(0x427002A4UL))
#define bFM3_MFS0_LIN_FCR_FDRQ                 *((volatile unsigned int*)(0x427002A8UL))
#define bFM3_MFS0_LIN_FCR_FRIE                 *((volatile unsigned int*)(0x427002ACUL))
#define bFM3_MFS0_LIN_FCR_FLSTE                *((volatile unsigned int*)(0x427002B0UL))
#define bFM3_MFS0_LIN_FCR0_FE1                 *((volatile unsigned int*)(0x42700280UL))
#define bFM3_MFS0_LIN_FCR0_FE2                 *((volatile unsigned int*)(0x42700284UL))
#define bFM3_MFS0_LIN_FCR0_FCL1                *((volatile unsigned int*)(0x42700288UL))
#define bFM3_MFS0_LIN_FCR0_FCL2                *((volatile unsigned int*)(0x4270028CUL))
#define bFM3_MFS0_LIN_FCR0_FSET                *((volatile unsigned int*)(0x42700290UL))
#define bFM3_MFS0_LIN_FCR0_FLD                 *((volatile unsigned int*)(0x42700294UL))
#define bFM3_MFS0_LIN_FCR0_FLST                *((volatile unsigned int*)(0x42700298UL))
#define bFM3_MFS0_LIN_FCR1_FSEL                *((volatile unsigned int*)(0x427002A0UL))
#define bFM3_MFS0_LIN_FCR1_FTIE                *((volatile unsigned int*)(0x427002A4UL))
#define bFM3_MFS0_LIN_FCR1_FDRQ                *((volatile unsigned int*)(0x427002A8UL))
#define bFM3_MFS0_LIN_FCR1_FRIE                *((volatile unsigned int*)(0x427002ACUL))
#define bFM3_MFS0_LIN_FCR1_FLSTE               *((volatile unsigned int*)(0x427002B0UL))
#define bFM3_MFS0_LIN_FBYTE_FD0                *((volatile unsigned int*)(0x42700300UL))
#define bFM3_MFS0_LIN_FBYTE_FD1                *((volatile unsigned int*)(0x42700304UL))
#define bFM3_MFS0_LIN_FBYTE_FD2                *((volatile unsigned int*)(0x42700308UL))
#define bFM3_MFS0_LIN_FBYTE_FD3                *((volatile unsigned int*)(0x4270030CUL))
#define bFM3_MFS0_LIN_FBYTE_FD4                *((volatile unsigned int*)(0x42700310UL))
#define bFM3_MFS0_LIN_FBYTE_FD5                *((volatile unsigned int*)(0x42700314UL))
#define bFM3_MFS0_LIN_FBYTE_FD6                *((volatile unsigned int*)(0x42700318UL))
#define bFM3_MFS0_LIN_FBYTE_FD7                *((volatile unsigned int*)(0x4270031CUL))
#define bFM3_MFS0_LIN_FBYTE_FD8                *((volatile unsigned int*)(0x42700320UL))
#define bFM3_MFS0_LIN_FBYTE_FD9                *((volatile unsigned int*)(0x42700324UL))
#define bFM3_MFS0_LIN_FBYTE_FD10               *((volatile unsigned int*)(0x42700328UL))
#define bFM3_MFS0_LIN_FBYTE_FD11               *((volatile unsigned int*)(0x4270032CUL))
#define bFM3_MFS0_LIN_FBYTE_FD12               *((volatile unsigned int*)(0x42700330UL))
#define bFM3_MFS0_LIN_FBYTE_FD13               *((volatile unsigned int*)(0x42700334UL))
#define bFM3_MFS0_LIN_FBYTE_FD14               *((volatile unsigned int*)(0x42700338UL))
#define bFM3_MFS0_LIN_FBYTE_FD15               *((volatile unsigned int*)(0x4270033CUL))
#define bFM3_MFS0_LIN_FBYTE1_FD0               *((volatile unsigned int*)(0x42700300UL))
#define bFM3_MFS0_LIN_FBYTE1_FD1               *((volatile unsigned int*)(0x42700304UL))
#define bFM3_MFS0_LIN_FBYTE1_FD2               *((volatile unsigned int*)(0x42700308UL))
#define bFM3_MFS0_LIN_FBYTE1_FD3               *((volatile unsigned int*)(0x4270030CUL))
#define bFM3_MFS0_LIN_FBYTE1_FD4               *((volatile unsigned int*)(0x42700310UL))
#define bFM3_MFS0_LIN_FBYTE1_FD5               *((volatile unsigned int*)(0x42700314UL))
#define bFM3_MFS0_LIN_FBYTE1_FD6               *((volatile unsigned int*)(0x42700318UL))
#define bFM3_MFS0_LIN_FBYTE1_FD7               *((volatile unsigned int*)(0x4270031CUL))
#define bFM3_MFS0_LIN_FBYTE2_FD8               *((volatile unsigned int*)(0x42700320UL))
#define bFM3_MFS0_LIN_FBYTE2_FD9               *((volatile unsigned int*)(0x42700324UL))
#define bFM3_MFS0_LIN_FBYTE2_FD10              *((volatile unsigned int*)(0x42700328UL))
#define bFM3_MFS0_LIN_FBYTE2_FD11              *((volatile unsigned int*)(0x4270032CUL))
#define bFM3_MFS0_LIN_FBYTE2_FD12              *((volatile unsigned int*)(0x42700330UL))
#define bFM3_MFS0_LIN_FBYTE2_FD13              *((volatile unsigned int*)(0x42700334UL))
#define bFM3_MFS0_LIN_FBYTE2_FD14              *((volatile unsigned int*)(0x42700338UL))
#define bFM3_MFS0_LIN_FBYTE2_FD15              *((volatile unsigned int*)(0x4270033CUL))

