sebastianmurf/Innovatek_PCB_5.0_001/PCB 5.0 FW/common/mb9a310k.h
/* I2C channel 0 registers */
#define bFM3_MFS0_I2C_SMR_TIE                  *((volatile unsigned int*)(0x42700008UL))
#define bFM3_MFS0_I2C_SMR_RIE                  *((volatile unsigned int*)(0x4270000CUL))
#define bFM3_MFS0_I2C_SMR_WUCR                 *((volatile unsigned int*)(0x42700010UL))
#define bFM3_MFS0_I2C_IBCR_INT                 *((volatile unsigned int*)(0x42700020UL))
#define bFM3_MFS0_I2C_IBCR_BER                 *((volatile unsigned int*)(0x42700024UL))
#define bFM3_MFS0_I2C_IBCR_INTE                *((volatile unsigned int*)(0x42700028UL))
#define bFM3_MFS0_I2C_IBCR_CNDE                *((volatile unsigned int*)(0x4270002CUL))
#define bFM3_MFS0_I2C_IBCR_WSEL                *((volatile unsigned int*)(0x42700030UL))
#define bFM3_MFS0_I2C_IBCR_ACKE                *((volatile unsigned int*)(0x42700034UL))
#define bFM3_MFS0_I2C_IBCR_ACT                 *((volatile unsigned int*)(0x42700038UL))
#define bFM3_MFS0_I2C_IBCR_SCC                 *((volatile unsigned int*)(0x42700038UL))
#define bFM3_MFS0_I2C_IBCR_MSS                 *((volatile unsigned int*)(0x4270003CUL))
#define bFM3_MFS0_I2C_IBSR_BB                  *((volatile unsigned int*)(0x42700080UL))
#define bFM3_MFS0_I2C_IBSR_SPC                 *((volatile unsigned int*)(0x42700084UL))
#define bFM3_MFS0_I2C_IBSR_RSC                 *((volatile unsigned int*)(0x42700088UL))
#define bFM3_MFS0_I2C_IBSR_AL                  *((volatile unsigned int*)(0x4270008CUL))
#define bFM3_MFS0_I2C_IBSR_TRX                 *((volatile unsigned int*)(0x42700090UL))
#define bFM3_MFS0_I2C_IBSR_RSA                 *((volatile unsigned int*)(0x42700094UL))
#define bFM3_MFS0_I2C_IBSR_RACK                *((volatile unsigned int*)(0x42700098UL))
#define bFM3_MFS0_I2C_IBSR_FBT                 *((volatile unsigned int*)(0x4270009CUL))
#define bFM3_MFS0_I2C_SSR_TBI                  *((volatile unsigned int*)(0x427000A0UL))
#define bFM3_MFS0_I2C_SSR_TDRE                 *((volatile unsigned int*)(0x427000A4UL))
#define bFM3_MFS0_I2C_SSR_RDRF                 *((volatile unsigned int*)(0x427000A8UL))
#define bFM3_MFS0_I2C_SSR_ORE                  *((volatile unsigned int*)(0x427000ACUL))
#define bFM3_MFS0_I2C_SSR_TBIE                 *((volatile unsigned int*)(0x427000B0UL))
#define bFM3_MFS0_I2C_SSR_DMA                  *((volatile unsigned int*)(0x427000B4UL))
#define bFM3_MFS0_I2C_SSR_TSET                 *((volatile unsigned int*)(0x427000B8UL))
#define bFM3_MFS0_I2C_SSR_REC                  *((volatile unsigned int*)(0x427000BCUL))
#define bFM3_MFS0_I2C_ISBA_SA0                 *((volatile unsigned int*)(0x42700200UL))
#define bFM3_MFS0_I2C_ISBA_SA1                 *((volatile unsigned int*)(0x42700204UL))
#define bFM3_MFS0_I2C_ISBA_SA2                 *((volatile unsigned int*)(0x42700208UL))
#define bFM3_MFS0_I2C_ISBA_SA3                 *((volatile unsigned int*)(0x4270020CUL))
#define bFM3_MFS0_I2C_ISBA_SA4                 *((volatile unsigned int*)(0x42700210UL))
#define bFM3_MFS0_I2C_ISBA_SA5                 *((volatile unsigned int*)(0x42700214UL))
#define bFM3_MFS0_I2C_ISBA_SA6                 *((volatile unsigned int*)(0x42700218UL))
#define bFM3_MFS0_I2C_ISBA_SAEN                *((volatile unsigned int*)(0x4270021CUL))
#define bFM3_MFS0_I2C_ISMK_SM0                 *((volatile unsigned int*)(0x42700220UL))
#define bFM3_MFS0_I2C_ISMK_SM1                 *((volatile unsigned int*)(0x42700224UL))
#define bFM3_MFS0_I2C_ISMK_SM2                 *((volatile unsigned int*)(0x42700228UL))
#define bFM3_MFS0_I2C_ISMK_SM3                 *((volatile unsigned int*)(0x4270022CUL))
#define bFM3_MFS0_I2C_ISMK_SM4                 *((volatile unsigned int*)(0x42700230UL))
#define bFM3_MFS0_I2C_ISMK_SM5                 *((volatile unsigned int*)(0x42700234UL))
#define bFM3_MFS0_I2C_ISMK_SM6                 *((volatile unsigned int*)(0x42700238UL))
#define bFM3_MFS0_I2C_ISMK_EN                  *((volatile unsigned int*)(0x4270023CUL))
#define bFM3_MFS0_I2C_FCR_FE1                  *((volatile unsigned int*)(0x42700280UL))
#define bFM3_MFS0_I2C_FCR_FE2                  *((volatile unsigned int*)(0x42700284UL))
#define bFM3_MFS0_I2C_FCR_FCL1                 *((volatile unsigned int*)(0x42700288UL))
#define bFM3_MFS0_I2C_FCR_FCL2                 *((volatile unsigned int*)(0x4270028CUL))
#define bFM3_MFS0_I2C_FCR_FSET                 *((volatile unsigned int*)(0x42700290UL))
#define bFM3_MFS0_I2C_FCR_FLD                  *((volatile unsigned int*)(0x42700294UL))
#define bFM3_MFS0_I2C_FCR_FLST                 *((volatile unsigned int*)(0x42700298UL))
#define bFM3_MFS0_I2C_FCR_FSEL                 *((volatile unsigned int*)(0x427002A0UL))
#define bFM3_MFS0_I2C_FCR_FTIE                 *((volatile unsigned int*)(0x427002A4UL))
#define bFM3_MFS0_I2C_FCR_FDRQ                 *((volatile unsigned int*)(0x427002A8UL))
#define bFM3_MFS0_I2C_FCR_FRIE                 *((volatile unsigned int*)(0x427002ACUL))
#define bFM3_MFS0_I2C_FCR_FLSTE                *((volatile unsigned int*)(0x427002B0UL))
#define bFM3_MFS0_I2C_FCR0_FE1                 *((volatile unsigned int*)(0x42700280UL))
#define bFM3_MFS0_I2C_FCR0_FE2                 *((volatile unsigned int*)(0x42700284UL))
#define bFM3_MFS0_I2C_FCR0_FCL1                *((volatile unsigned int*)(0x42700288UL))
#define bFM3_MFS0_I2C_FCR0_FCL2                *((volatile unsigned int*)(0x4270028CUL))
#define bFM3_MFS0_I2C_FCR0_FSET                *((volatile unsigned int*)(0x42700290UL))
#define bFM3_MFS0_I2C_FCR0_FLD                 *((volatile unsigned int*)(0x42700294UL))
#define bFM3_MFS0_I2C_FCR0_FLST                *((volatile unsigned int*)(0x42700298UL))
#define bFM3_MFS0_I2C_FCR1_FSEL                *((volatile unsigned int*)(0x427002A0UL))
#define bFM3_MFS0_I2C_FCR1_FTIE                *((volatile unsigned int*)(0x427002A4UL))
#define bFM3_MFS0_I2C_FCR1_FDRQ                *((volatile unsigned int*)(0x427002A8UL))
#define bFM3_MFS0_I2C_FCR1_FRIE                *((volatile unsigned int*)(0x427002ACUL))
#define bFM3_MFS0_I2C_FCR1_FLSTE               *((volatile unsigned int*)(0x427002B0UL))
#define bFM3_MFS0_I2C_FBYTE_FD0                *((volatile unsigned int*)(0x42700300UL))
#define bFM3_MFS0_I2C_FBYTE_FD1                *((volatile unsigned int*)(0x42700304UL))
#define bFM3_MFS0_I2C_FBYTE_FD2                *((volatile unsigned int*)(0x42700308UL))
#define bFM3_MFS0_I2C_FBYTE_FD3                *((volatile unsigned int*)(0x4270030CUL))
#define bFM3_MFS0_I2C_FBYTE_FD4                *((volatile unsigned int*)(0x42700310UL))
#define bFM3_MFS0_I2C_FBYTE_FD5                *((volatile unsigned int*)(0x42700314UL))
#define bFM3_MFS0_I2C_FBYTE_FD6                *((volatile unsigned int*)(0x42700318UL))
#define bFM3_MFS0_I2C_FBYTE_FD7                *((volatile unsigned int*)(0x4270031CUL))
#define bFM3_MFS0_I2C_FBYTE_FD8                *((volatile unsigned int*)(0x42700320UL))
#define bFM3_MFS0_I2C_FBYTE_FD9                *((volatile unsigned int*)(0x42700324UL))
#define bFM3_MFS0_I2C_FBYTE_FD10               *((volatile unsigned int*)(0x42700328UL))
#define bFM3_MFS0_I2C_FBYTE_FD11               *((volatile unsigned int*)(0x4270032CUL))
#define bFM3_MFS0_I2C_FBYTE_FD12               *((volatile unsigned int*)(0x42700330UL))
#define bFM3_MFS0_I2C_FBYTE_FD13               *((volatile unsigned int*)(0x42700334UL))
#define bFM3_MFS0_I2C_FBYTE_FD14               *((volatile unsigned int*)(0x42700338UL))
#define bFM3_MFS0_I2C_FBYTE_FD15               *((volatile unsigned int*)(0x4270033CUL))
#define bFM3_MFS0_I2C_FBYTE1_FD0               *((volatile unsigned int*)(0x42700300UL))
#define bFM3_MFS0_I2C_FBYTE1_FD1               *((volatile unsigned int*)(0x42700304UL))
#define bFM3_MFS0_I2C_FBYTE1_FD2               *((volatile unsigned int*)(0x42700308UL))
#define bFM3_MFS0_I2C_FBYTE1_FD3               *((volatile unsigned int*)(0x4270030CUL))
#define bFM3_MFS0_I2C_FBYTE1_FD4               *((volatile unsigned int*)(0x42700310UL))
#define bFM3_MFS0_I2C_FBYTE1_FD5               *((volatile unsigned int*)(0x42700314UL))
#define bFM3_MFS0_I2C_FBYTE1_FD6               *((volatile unsigned int*)(0x42700318UL))
#define bFM3_MFS0_I2C_FBYTE1_FD7               *((volatile unsigned int*)(0x4270031CUL))
#define bFM3_MFS0_I2C_FBYTE2_FD8               *((volatile unsigned int*)(0x42700320UL))
#define bFM3_MFS0_I2C_FBYTE2_FD9               *((volatile unsigned int*)(0x42700324UL))
#define bFM3_MFS0_I2C_FBYTE2_FD10              *((volatile unsigned int*)(0x42700328UL))
#define bFM3_MFS0_I2C_FBYTE2_FD11              *((volatile unsigned int*)(0x4270032CUL))
#define bFM3_MFS0_I2C_FBYTE2_FD12              *((volatile unsigned int*)(0x42700330UL))
#define bFM3_MFS0_I2C_FBYTE2_FD13              *((volatile unsigned int*)(0x42700334UL))
#define bFM3_MFS0_I2C_FBYTE2_FD14              *((volatile unsigned int*)(0x42700338UL))
#define bFM3_MFS0_I2C_FBYTE2_FD15              *((volatile unsigned int*)(0x4270033CUL))

/* UART asynchronous channel 1 registers */
#define bFM3_MFS1_UART_SMR_SOE                 *((volatile unsigned int*)(0x42702000UL))
#define bFM3_MFS1_UART_SMR_BDS                 *((volatile unsigned int*)(0x42702008UL))
#define bFM3_MFS1_UART_SMR_SBL                 *((volatile unsigned int*)(0x4270200CUL))
#define bFM3_MFS1_UART_SMR_WUCR                *((volatile unsigned int*)(0x42702010UL))
#define bFM3_MFS1_UART_SCR_TXE                 *((volatile unsigned int*)(0x42702020UL))
#define bFM3_MFS1_UART_SCR_RXE                 *((volatile unsigned int*)(0x42702024UL))
#define bFM3_MFS1_UART_SCR_TBIE                *((volatile unsigned int*)(0x42702028UL))
#define bFM3_MFS1_UART_SCR_TIE                 *((volatile unsigned int*)(0x4270202CUL))
#define bFM3_MFS1_UART_SCR_RIE                 *((volatile unsigned int*)(0x42702030UL))
#define bFM3_MFS1_UART_SCR_UPCL                *((volatile unsigned int*)(0x4270203CUL))
#define bFM3_MFS1_UART_ESCR_L0                 *((volatile unsigned int*)(0x42702080UL))
#define bFM3_MFS1_UART_ESCR_L1                 *((volatile unsigned int*)(0x42702084UL))
#define bFM3_MFS1_UART_ESCR_L2                 *((volatile unsigned int*)(0x42702088UL))
#define bFM3_MFS1_UART_ESCR_P                  *((volatile unsigned int*)(0x4270208CUL))
#define bFM3_MFS1_UART_ESCR_PEN                *((volatile unsigned int*)(0x42702090UL))
#define bFM3_MFS1_UART_ESCR_INV                *((volatile unsigned int*)(0x42702094UL))
#define bFM3_MFS1_UART_ESCR_ESBL               *((volatile unsigned int*)(0x42702098UL))
#define bFM3_MFS1_UART_ESCR_FLWEN              *((volatile unsigned int*)(0x4270209CUL))
#define bFM3_MFS1_UART_SSR_TBI                 *((volatile unsigned int*)(0x427020A0UL))
#define bFM3_MFS1_UART_SSR_TDRE                *((volatile unsigned int*)(0x427020A4UL))
#define bFM3_MFS1_UART_SSR_RDRF                *((volatile unsigned int*)(0x427020A8UL))
#define bFM3_MFS1_UART_SSR_ORE                 *((volatile unsigned int*)(0x427020ACUL))
#define bFM3_MFS1_UART_SSR_FRE                 *((volatile unsigned int*)(0x427020B0UL))
#define bFM3_MFS1_UART_SSR_PE                  *((volatile unsigned int*)(0x427020B4UL))
#define bFM3_MFS1_UART_SSR_REC                 *((volatile unsigned int*)(0x427020BCUL))
#define bFM3_MFS1_UART_RDR_AD                  *((volatile unsigned int*)(0x42702120UL))
#define bFM3_MFS1_UART_TDR_AD                  *((volatile unsigned int*)(0x42702120UL))
#define bFM3_MFS1_UART_BGR_EXT                 *((volatile unsigned int*)(0x427021BCUL))
#define bFM3_MFS1_UART_BGR1_EXT                *((volatile unsigned int*)(0x427021BCUL))
#define bFM3_MFS1_UART_FCR_FE1                 *((volatile unsigned int*)(0x42702280UL))
#define bFM3_MFS1_UART_FCR_FE2                 *((volatile unsigned int*)(0x42702284UL))
#define bFM3_MFS1_UART_FCR_FCL1                *((volatile unsigned int*)(0x42702288UL))
#define bFM3_MFS1_UART_FCR_FCL2                *((volatile unsigned int*)(0x4270228CUL))
#define bFM3_MFS1_UART_FCR_FSET                *((volatile unsigned int*)(0x42702290UL))
#define bFM3_MFS1_UART_FCR_FLD                 *((volatile unsigned int*)(0x42702294UL))
#define bFM3_MFS1_UART_FCR_FLST                *((volatile unsigned int*)(0x42702298UL))
#define bFM3_MFS1_UART_FCR_FSEL                *((volatile unsigned int*)(0x427022A0UL))
#define bFM3_MFS1_UART_FCR_FTIE                *((volatile unsigned int*)(0x427022A4UL))
#define bFM3_MFS1_UART_FCR_FDRQ                *((volatile unsigned int*)(0x427022A8UL))
#define bFM3_MFS1_UART_FCR_FRIE                *((volatile unsigned int*)(0x427022ACUL))
#define bFM3_MFS1_UART_FCR_FLSTE               *((volatile unsigned int*)(0x427022B0UL))
#define bFM3_MFS1_UART_FCR0_FE1                *((volatile unsigned int*)(0x42702280UL))
#define bFM3_MFS1_UART_FCR0_FE2                *((volatile unsigned int*)(0x42702284UL))
#define bFM3_MFS1_UART_FCR0_FCL1               *((volatile unsigned int*)(0x42702288UL))
#define bFM3_MFS1_UART_FCR0_FCL2               *((volatile unsigned int*)(0x4270228CUL))
#define bFM3_MFS1_UART_FCR0_FSET               *((volatile unsigned int*)(0x42702290UL))
#define bFM3_MFS1_UART_FCR0_FLD                *((volatile unsigned int*)(0x42702294UL))
#define bFM3_MFS1_UART_FCR0_FLST               *((volatile unsigned int*)(0x42702298UL))
#define bFM3_MFS1_UART_FCR1_FSEL               *((volatile unsigned int*)(0x427022A0UL))
#define bFM3_MFS1_UART_FCR1_FTIE               *((volatile unsigned int*)(0x427022A4UL))
#define bFM3_MFS1_UART_FCR1_FDRQ               *((volatile unsigned int*)(0x427022A8UL))
#define bFM3_MFS1_UART_FCR1_FRIE               *((volatile unsigned int*)(0x427022ACUL))
#define bFM3_MFS1_UART_FCR1_FLSTE              *((volatile unsigned int*)(0x427022B0UL))
#define bFM3_MFS1_UART_FBYTE_FD0               *((volatile unsigned int*)(0x42702300UL))
#define bFM3_MFS1_UART_FBYTE_FD1               *((volatile unsigned int*)(0x42702304UL))
#define bFM3_MFS1_UART_FBYTE_FD2               *((volatile unsigned int*)(0x42702308UL))
#define bFM3_MFS1_UART_FBYTE_FD3               *((volatile unsigned int*)(0x4270230CUL))
#define bFM3_MFS1_UART_FBYTE_FD4               *((volatile unsigned int*)(0x42702310UL))
#define bFM3_MFS1_UART_FBYTE_FD5               *((volatile unsigned int*)(0x42702314UL))
#define bFM3_MFS1_UART_FBYTE_FD6               *((volatile unsigned int*)(0x42702318UL))
#define bFM3_MFS1_UART_FBYTE_FD7               *((volatile unsigned int*)(0x4270231CUL))
#define bFM3_MFS1_UART_FBYTE_FD8               *((volatile unsigned int*)(0x42702320UL))
#define bFM3_MFS1_UART_FBYTE_FD9               *((volatile unsigned int*)(0x42702324UL))
#define bFM3_MFS1_UART_FBYTE_FD10              *((volatile unsigned int*)(0x42702328UL))
#define bFM3_MFS1_UART_FBYTE_FD11              *((volatile unsigned int*)(0x4270232CUL))
#define bFM3_MFS1_UART_FBYTE_FD12              *((volatile unsigned int*)(0x42702330UL))
#define bFM3_MFS1_UART_FBYTE_FD13              *((volatile unsigned int*)(0x42702334UL))
#define bFM3_MFS1_UART_FBYTE_FD14              *((volatile unsigned int*)(0x42702338UL))
#define bFM3_MFS1_UART_FBYTE_FD15              *((volatile unsigned int*)(0x4270233CUL))
#define bFM3_MFS1_UART_FBYTE1_FD0              *((volatile unsigned int*)(0x42702300UL))
#define bFM3_MFS1_UART_FBYTE1_FD1              *((volatile unsigned int*)(0x42702304UL))
#define bFM3_MFS1_UART_FBYTE1_FD2              *((volatile unsigned int*)(0x42702308UL))
#define bFM3_MFS1_UART_FBYTE1_FD3              *((volatile unsigned int*)(0x4270230CUL))
#define bFM3_MFS1_UART_FBYTE1_FD4              *((volatile unsigned int*)(0x42702310UL))
#define bFM3_MFS1_UART_FBYTE1_FD5              *((volatile unsigned int*)(0x42702314UL))
#define bFM3_MFS1_UART_FBYTE1_FD6              *((volatile unsigned int*)(0x42702318UL))
#define bFM3_MFS1_UART_FBYTE1_FD7              *((volatile unsigned int*)(0x4270231CUL))
#define bFM3_MFS1_UART_FBYTE2_FD8              *((volatile unsigned int*)(0x42702320UL))
#define bFM3_MFS1_UART_FBYTE2_FD9              *((volatile unsigned int*)(0x42702324UL))
#define bFM3_MFS1_UART_FBYTE2_FD10             *((volatile unsigned int*)(0x42702328UL))
#define bFM3_MFS1_UART_FBYTE2_FD11             *((volatile unsigned int*)(0x4270232CUL))
#define bFM3_MFS1_UART_FBYTE2_FD12             *((volatile unsigned int*)(0x42702330UL))
#define bFM3_MFS1_UART_FBYTE2_FD13             *((volatile unsigned int*)(0x42702334UL))
#define bFM3_MFS1_UART_FBYTE2_FD14             *((volatile unsigned int*)(0x42702338UL))
#define bFM3_MFS1_UART_FBYTE2_FD15             *((volatile unsigned int*)(0x4270233CUL))

/* UART synchronous channel 1 registers */
#define bFM3_MFS1_CSIO_SMR_SOE                 *((volatile unsigned int*)(0x42702000UL))
#define bFM3_MFS1_CSIO_SMR_SCKE                *((volatile unsigned int*)(0x42702004UL))
#define bFM3_MFS1_CSIO_SMR_BDS                 *((volatile unsigned int*)(0x42702008UL))
#define bFM3_MFS1_CSIO_SMR_SCINV               *((volatile unsigned int*)(0x4270200CUL))
#define bFM3_MFS1_CSIO_SMR_WUCR                *((volatile unsigned int*)(0x42702010UL))
#define bFM3_MFS1_CSIO_SCR_TXE                 *((volatile unsigned int*)(0x42702020UL))
#define bFM3_MFS1_CSIO_SCR_RXE                 *((volatile unsigned int*)(0x42702024UL))
#define bFM3_MFS1_CSIO_SCR_TBIE                *((volatile unsigned int*)(0x42702028UL))
#define bFM3_MFS1_CSIO_SCR_TIE                 *((volatile unsigned int*)(0x4270202CUL))
#define bFM3_MFS1_CSIO_SCR_RIE                 *((volatile unsigned int*)(0x42702030UL))
#define bFM3_MFS1_CSIO_SCR_SPI                 *((volatile unsigned int*)(0x42702034UL))
#define bFM3_MFS1_CSIO_SCR_MS                  *((volatile unsigned int*)(0x42702038UL))
#define bFM3_MFS1_CSIO_SCR_UPCL                *((volatile unsigned int*)(0x4270203CUL))
#define bFM3_MFS1_CSIO_ESCR_L0                 *((volatile unsigned int*)(0x42702080UL))
#define bFM3_MFS1_CSIO_ESCR_L1                 *((volatile unsigned int*)(0x42702084UL))
#define bFM3_MFS1_CSIO_ESCR_L2                 *((volatile unsigned int*)(0x42702088UL))
#define bFM3_MFS1_CSIO_ESCR_WT0                *((volatile unsigned int*)(0x4270208CUL))
#define bFM3_MFS1_CSIO_ESCR_WT1                *((volatile unsigned int*)(0x42702090UL))
#define bFM3_MFS1_CSIO_ESCR_SOP                *((volatile unsigned int*)(0x4270209CUL))
#define bFM3_MFS1_CSIO_SSR_TBI                 *((volatile unsigned int*)(0x427020A0UL))
#define bFM3_MFS1_CSIO_SSR_TDRE                *((volatile unsigned int*)(0x427020A4UL))
#define bFM3_MFS1_CSIO_SSR_RDRF                *((volatile unsigned int*)(0x427020A8UL))
#define bFM3_MFS1_CSIO_SSR_ORE                 *((volatile unsigned int*)(0x427020ACUL))
#define bFM3_MFS1_CSIO_SSR_REC                 *((volatile unsigned int*)(0x427020BCUL))
#define bFM3_MFS1_CSIO_FCR_FE1                 *((volatile unsigned int*)(0x42702280UL))
#define bFM3_MFS1_CSIO_FCR_FE2                 *((volatile unsigned int*)(0x42702284UL))
#define bFM3_MFS1_CSIO_FCR_FCL1                *((volatile unsigned int*)(0x42702288UL))
#define bFM3_MFS1_CSIO_FCR_FCL2                *((volatile unsigned int*)(0x4270228CUL))
#define bFM3_MFS1_CSIO_FCR_FSET                *((volatile unsigned int*)(0x42702290UL))
#define bFM3_MFS1_CSIO_FCR_FLD                 *((volatile unsigned int*)(0x42702294UL))
#define bFM3_MFS1_CSIO_FCR_FLST                *((volatile unsigned int*)(0x42702298UL))
#define bFM3_MFS1_CSIO_FCR_FSEL                *((volatile unsigned int*)(0x427022A0UL))
#define bFM3_MFS1_CSIO_FCR_FTIE                *((volatile unsigned int*)(0x427022A4UL))
#define bFM3_MFS1_CSIO_FCR_FDRQ                *((volatile unsigned int*)(0x427022A8UL))
#define bFM3_MFS1_CSIO_FCR_FRIE                *((volatile unsigned int*)(0x427022ACUL))
#define bFM3_MFS1_CSIO_FCR_FLSTE               *((volatile unsigned int*)(0x427022B0UL))
#define bFM3_MFS1_CSIO_FCR0_FE1                *((volatile unsigned int*)(0x42702280UL))
#define bFM3_MFS1_CSIO_FCR0_FE2                *((volatile unsigned int*)(0x42702284UL))
#define bFM3_MFS1_CSIO_FCR0_FCL1               *((volatile unsigned int*)(0x42702288UL))
#define bFM3_MFS1_CSIO_FCR0_FCL2               *((volatile unsigned int*)(0x4270228CUL))
#define bFM3_MFS1_CSIO_FCR0_FSET               *((volatile unsigned int*)(0x42702290UL))
#define bFM3_MFS1_CSIO_FCR0_FLD                *((volatile unsigned int*)(0x42702294UL))
#define bFM3_MFS1_CSIO_FCR0_FLST               *((volatile unsigned int*)(0x42702298UL))
#define bFM3_MFS1_CSIO_FCR1_FSEL               *((volatile unsigned int*)(0x427022A0UL))
#define bFM3_MFS1_CSIO_FCR1_FTIE               *((volatile unsigned int*)(0x427022A4UL))
#define bFM3_MFS1_CSIO_FCR1_FDRQ               *((volatile unsigned int*)(0x427022A8UL))
#define bFM3_MFS1_CSIO_FCR1_FRIE               *((volatile unsigned int*)(0x427022ACUL))
#define bFM3_MFS1_CSIO_FCR1_FLSTE              *((volatile unsigned int*)(0x427022B0UL))
#define bFM3_MFS1_CSIO_FBYTE_FD0               *((volatile unsigned int*)(0x42702300UL))
#define bFM3_MFS1_CSIO_FBYTE_FD1               *((volatile unsigned int*)(0x42702304UL))
#define bFM3_MFS1_CSIO_FBYTE_FD2               *((volatile unsigned int*)(0x42702308UL))
#define bFM3_MFS1_CSIO_FBYTE_FD3               *((volatile unsigned int*)(0x4270230CUL))
#define bFM3_MFS1_CSIO_FBYTE_FD4               *((volatile unsigned int*)(0x42702310UL))
#define bFM3_MFS1_CSIO_FBYTE_FD5               *((volatile unsigned int*)(0x42702314UL))
#define bFM3_MFS1_CSIO_FBYTE_FD6               *((volatile unsigned int*)(0x42702318UL))
#define bFM3_MFS1_CSIO_FBYTE_FD7               *((volatile unsigned int*)(0x4270231CUL))
#define bFM3_MFS1_CSIO_FBYTE_FD8               *((volatile unsigned int*)(0x42702320UL))
#define bFM3_MFS1_CSIO_FBYTE_FD9               *((volatile unsigned int*)(0x42702324UL))
#define bFM3_MFS1_CSIO_FBYTE_FD10              *((volatile unsigned int*)(0x42702328UL))
#define bFM3_MFS1_CSIO_FBYTE_FD11              *((volatile unsigned int*)(0x4270232CUL))
#define bFM3_MFS1_CSIO_FBYTE_FD12              *((volatile unsigned int*)(0x42702330UL))
#define bFM3_MFS1_CSIO_FBYTE_FD13              *((volatile unsigned int*)(0x42702334UL))
#define bFM3_MFS1_CSIO_FBYTE_FD14              *((volatile unsigned int*)(0x42702338UL))
#define bFM3_MFS1_CSIO_FBYTE_FD15              *((volatile unsigned int*)(0x4270233CUL))
#define bFM3_MFS1_CSIO_FBYTE1_FD0              *((volatile unsigned int*)(0x42702300UL))
#define bFM3_MFS1_CSIO_FBYTE1_FD1              *((volatile unsigned int*)(0x42702304UL))
#define bFM3_MFS1_CSIO_FBYTE1_FD2              *((volatile unsigned int*)(0x42702308UL))
#define bFM3_MFS1_CSIO_FBYTE1_FD3              *((volatile unsigned int*)(0x4270230CUL))
#define bFM3_MFS1_CSIO_FBYTE1_FD4              *((volatile unsigned int*)(0x42702310UL))
#define bFM3_MFS1_CSIO_FBYTE1_FD5              *((volatile unsigned int*)(0x42702314UL))
#define bFM3_MFS1_CSIO_FBYTE1_FD6              *((volatile unsigned int*)(0x42702318UL))
#define bFM3_MFS1_CSIO_FBYTE1_FD7              *((volatile unsigned int*)(0x4270231CUL))
#define bFM3_MFS1_CSIO_FBYTE2_FD8              *((volatile unsigned int*)(0x42702320UL))
#define bFM3_MFS1_CSIO_FBYTE2_FD9              *((volatile unsigned int*)(0x42702324UL))
#define bFM3_MFS1_CSIO_FBYTE2_FD10             *((volatile unsigned int*)(0x42702328UL))
#define bFM3_MFS1_CSIO_FBYTE2_FD11             *((volatile unsigned int*)(0x4270232CUL))
#define bFM3_MFS1_CSIO_FBYTE2_FD12             *((volatile unsigned int*)(0x42702330UL))
#define bFM3_MFS1_CSIO_FBYTE2_FD13             *((volatile unsigned int*)(0x42702334UL))
#define bFM3_MFS1_CSIO_FBYTE2_FD14             *((volatile unsigned int*)(0x42702338UL))
#define bFM3_MFS1_CSIO_FBYTE2_FD15             *((volatile unsigned int*)(0x4270233CUL))

