sebastianmurf/Innovatek_PCB_5.0_001/PCB 5.0 FW/common/mb9a310k.h
/* UART LIN channel 3 registers */
#define bFM3_MFS3_LIN_SMR_SOE                  *((volatile unsigned int*)(0x42706000UL))
#define bFM3_MFS3_LIN_SMR_SBL                  *((volatile unsigned int*)(0x4270600CUL))
#define bFM3_MFS3_LIN_SMR_WUCR                 *((volatile unsigned int*)(0x42706010UL))
#define bFM3_MFS3_LIN_SCR_TXE                  *((volatile unsigned int*)(0x42706020UL))
#define bFM3_MFS3_LIN_SCR_RXE                  *((volatile unsigned int*)(0x42706024UL))
#define bFM3_MFS3_LIN_SCR_TBIE                 *((volatile unsigned int*)(0x42706028UL))
#define bFM3_MFS3_LIN_SCR_TIE                  *((volatile unsigned int*)(0x4270602CUL))
#define bFM3_MFS3_LIN_SCR_RIE                  *((volatile unsigned int*)(0x42706030UL))
#define bFM3_MFS3_LIN_SCR_LBR                  *((volatile unsigned int*)(0x42706034UL))
#define bFM3_MFS3_LIN_SCR_MS                   *((volatile unsigned int*)(0x42706038UL))
#define bFM3_MFS3_LIN_SCR_UPCL                 *((volatile unsigned int*)(0x4270603CUL))
#define bFM3_MFS3_LIN_ESCR_DEL0                *((volatile unsigned int*)(0x42706080UL))
#define bFM3_MFS3_LIN_ESCR_DEL1                *((volatile unsigned int*)(0x42706084UL))
#define bFM3_MFS3_LIN_ESCR_LBL0                *((volatile unsigned int*)(0x42706088UL))
#define bFM3_MFS3_LIN_ESCR_LBL1                *((volatile unsigned int*)(0x4270608CUL))
#define bFM3_MFS3_LIN_ESCR_LBIE                *((volatile unsigned int*)(0x42706090UL))
#define bFM3_MFS3_LIN_ESCR_ESBL                *((volatile unsigned int*)(0x42706098UL))
#define bFM3_MFS3_LIN_SSR_TBI                  *((volatile unsigned int*)(0x427060A0UL))
#define bFM3_MFS3_LIN_SSR_TDRE                 *((volatile unsigned int*)(0x427060A4UL))
#define bFM3_MFS3_LIN_SSR_RDRF                 *((volatile unsigned int*)(0x427060A8UL))
#define bFM3_MFS3_LIN_SSR_ORE                  *((volatile unsigned int*)(0x427060ACUL))
#define bFM3_MFS3_LIN_SSR_FRE                  *((volatile unsigned int*)(0x427060B0UL))
#define bFM3_MFS3_LIN_SSR_LBD                  *((volatile unsigned int*)(0x427060B4UL))
#define bFM3_MFS3_LIN_SSR_REC                  *((volatile unsigned int*)(0x427060BCUL))
#define bFM3_MFS3_LIN_BGR_EXT                  *((volatile unsigned int*)(0x427061BCUL))
#define bFM3_MFS3_LIN_BGR1_EXT                 *((volatile unsigned int*)(0x427061BCUL))
#define bFM3_MFS3_LIN_FCR_FE1                  *((volatile unsigned int*)(0x42706280UL))
#define bFM3_MFS3_LIN_FCR_FE2                  *((volatile unsigned int*)(0x42706284UL))
#define bFM3_MFS3_LIN_FCR_FCL1                 *((volatile unsigned int*)(0x42706288UL))
#define bFM3_MFS3_LIN_FCR_FCL2                 *((volatile unsigned int*)(0x4270628CUL))
#define bFM3_MFS3_LIN_FCR_FSET                 *((volatile unsigned int*)(0x42706290UL))
#define bFM3_MFS3_LIN_FCR_FLD                  *((volatile unsigned int*)(0x42706294UL))
#define bFM3_MFS3_LIN_FCR_FLST                 *((volatile unsigned int*)(0x42706298UL))
#define bFM3_MFS3_LIN_FCR_FSEL                 *((volatile unsigned int*)(0x427062A0UL))
#define bFM3_MFS3_LIN_FCR_FTIE                 *((volatile unsigned int*)(0x427062A4UL))
#define bFM3_MFS3_LIN_FCR_FDRQ                 *((volatile unsigned int*)(0x427062A8UL))
#define bFM3_MFS3_LIN_FCR_FRIE                 *((volatile unsigned int*)(0x427062ACUL))
#define bFM3_MFS3_LIN_FCR_FLSTE                *((volatile unsigned int*)(0x427062B0UL))
#define bFM3_MFS3_LIN_FCR0_FE1                 *((volatile unsigned int*)(0x42706280UL))
#define bFM3_MFS3_LIN_FCR0_FE2                 *((volatile unsigned int*)(0x42706284UL))
#define bFM3_MFS3_LIN_FCR0_FCL1                *((volatile unsigned int*)(0x42706288UL))
#define bFM3_MFS3_LIN_FCR0_FCL2                *((volatile unsigned int*)(0x4270628CUL))
#define bFM3_MFS3_LIN_FCR0_FSET                *((volatile unsigned int*)(0x42706290UL))
#define bFM3_MFS3_LIN_FCR0_FLD                 *((volatile unsigned int*)(0x42706294UL))
#define bFM3_MFS3_LIN_FCR0_FLST                *((volatile unsigned int*)(0x42706298UL))
#define bFM3_MFS3_LIN_FCR1_FSEL                *((volatile unsigned int*)(0x427062A0UL))
#define bFM3_MFS3_LIN_FCR1_FTIE                *((volatile unsigned int*)(0x427062A4UL))
#define bFM3_MFS3_LIN_FCR1_FDRQ                *((volatile unsigned int*)(0x427062A8UL))
#define bFM3_MFS3_LIN_FCR1_FRIE                *((volatile unsigned int*)(0x427062ACUL))
#define bFM3_MFS3_LIN_FCR1_FLSTE               *((volatile unsigned int*)(0x427062B0UL))
#define bFM3_MFS3_LIN_FBYTE_FD0                *((volatile unsigned int*)(0x42706300UL))
#define bFM3_MFS3_LIN_FBYTE_FD1                *((volatile unsigned int*)(0x42706304UL))
#define bFM3_MFS3_LIN_FBYTE_FD2                *((volatile unsigned int*)(0x42706308UL))
#define bFM3_MFS3_LIN_FBYTE_FD3                *((volatile unsigned int*)(0x4270630CUL))
#define bFM3_MFS3_LIN_FBYTE_FD4                *((volatile unsigned int*)(0x42706310UL))
#define bFM3_MFS3_LIN_FBYTE_FD5                *((volatile unsigned int*)(0x42706314UL))
#define bFM3_MFS3_LIN_FBYTE_FD6                *((volatile unsigned int*)(0x42706318UL))
#define bFM3_MFS3_LIN_FBYTE_FD7                *((volatile unsigned int*)(0x4270631CUL))
#define bFM3_MFS3_LIN_FBYTE_FD8                *((volatile unsigned int*)(0x42706320UL))
#define bFM3_MFS3_LIN_FBYTE_FD9                *((volatile unsigned int*)(0x42706324UL))
#define bFM3_MFS3_LIN_FBYTE_FD10               *((volatile unsigned int*)(0x42706328UL))
#define bFM3_MFS3_LIN_FBYTE_FD11               *((volatile unsigned int*)(0x4270632CUL))
#define bFM3_MFS3_LIN_FBYTE_FD12               *((volatile unsigned int*)(0x42706330UL))
#define bFM3_MFS3_LIN_FBYTE_FD13               *((volatile unsigned int*)(0x42706334UL))
#define bFM3_MFS3_LIN_FBYTE_FD14               *((volatile unsigned int*)(0x42706338UL))
#define bFM3_MFS3_LIN_FBYTE_FD15               *((volatile unsigned int*)(0x4270633CUL))
#define bFM3_MFS3_LIN_FBYTE1_FD0               *((volatile unsigned int*)(0x42706300UL))
#define bFM3_MFS3_LIN_FBYTE1_FD1               *((volatile unsigned int*)(0x42706304UL))
#define bFM3_MFS3_LIN_FBYTE1_FD2               *((volatile unsigned int*)(0x42706308UL))
#define bFM3_MFS3_LIN_FBYTE1_FD3               *((volatile unsigned int*)(0x4270630CUL))
#define bFM3_MFS3_LIN_FBYTE1_FD4               *((volatile unsigned int*)(0x42706310UL))
#define bFM3_MFS3_LIN_FBYTE1_FD5               *((volatile unsigned int*)(0x42706314UL))
#define bFM3_MFS3_LIN_FBYTE1_FD6               *((volatile unsigned int*)(0x42706318UL))
#define bFM3_MFS3_LIN_FBYTE1_FD7               *((volatile unsigned int*)(0x4270631CUL))
#define bFM3_MFS3_LIN_FBYTE2_FD8               *((volatile unsigned int*)(0x42706320UL))
#define bFM3_MFS3_LIN_FBYTE2_FD9               *((volatile unsigned int*)(0x42706324UL))
#define bFM3_MFS3_LIN_FBYTE2_FD10              *((volatile unsigned int*)(0x42706328UL))
#define bFM3_MFS3_LIN_FBYTE2_FD11              *((volatile unsigned int*)(0x4270632CUL))
#define bFM3_MFS3_LIN_FBYTE2_FD12              *((volatile unsigned int*)(0x42706330UL))
#define bFM3_MFS3_LIN_FBYTE2_FD13              *((volatile unsigned int*)(0x42706334UL))
#define bFM3_MFS3_LIN_FBYTE2_FD14              *((volatile unsigned int*)(0x42706338UL))
#define bFM3_MFS3_LIN_FBYTE2_FD15              *((volatile unsigned int*)(0x4270633CUL))

/* I2C channel 3 registers */
#define bFM3_MFS3_I2C_SMR_TIE                  *((volatile unsigned int*)(0x42706008UL))
#define bFM3_MFS3_I2C_SMR_RIE                  *((volatile unsigned int*)(0x4270600CUL))
#define bFM3_MFS3_I2C_SMR_WUCR                 *((volatile unsigned int*)(0x42706010UL))
#define bFM3_MFS3_I2C_IBCR_INT                 *((volatile unsigned int*)(0x42706020UL))
#define bFM3_MFS3_I2C_IBCR_BER                 *((volatile unsigned int*)(0x42706024UL))
#define bFM3_MFS3_I2C_IBCR_INTE                *((volatile unsigned int*)(0x42706028UL))
#define bFM3_MFS3_I2C_IBCR_CNDE                *((volatile unsigned int*)(0x4270602CUL))
#define bFM3_MFS3_I2C_IBCR_WSEL                *((volatile unsigned int*)(0x42706030UL))
#define bFM3_MFS3_I2C_IBCR_ACKE                *((volatile unsigned int*)(0x42706034UL))
#define bFM3_MFS3_I2C_IBCR_ACT                 *((volatile unsigned int*)(0x42706038UL))
#define bFM3_MFS3_I2C_IBCR_SCC                 *((volatile unsigned int*)(0x42706038UL))
#define bFM3_MFS3_I2C_IBCR_MSS                 *((volatile unsigned int*)(0x4270603CUL))
#define bFM3_MFS3_I2C_IBSR_BB                  *((volatile unsigned int*)(0x42706080UL))
#define bFM3_MFS3_I2C_IBSR_SPC                 *((volatile unsigned int*)(0x42706084UL))
#define bFM3_MFS3_I2C_IBSR_RSC                 *((volatile unsigned int*)(0x42706088UL))
#define bFM3_MFS3_I2C_IBSR_AL                  *((volatile unsigned int*)(0x4270608CUL))
#define bFM3_MFS3_I2C_IBSR_TRX                 *((volatile unsigned int*)(0x42706090UL))
#define bFM3_MFS3_I2C_IBSR_RSA                 *((volatile unsigned int*)(0x42706094UL))
#define bFM3_MFS3_I2C_IBSR_RACK                *((volatile unsigned int*)(0x42706098UL))
#define bFM3_MFS3_I2C_IBSR_FBT                 *((volatile unsigned int*)(0x4270609CUL))
#define bFM3_MFS3_I2C_SSR_TBI                  *((volatile unsigned int*)(0x427060A0UL))
#define bFM3_MFS3_I2C_SSR_TDRE                 *((volatile unsigned int*)(0x427060A4UL))
#define bFM3_MFS3_I2C_SSR_RDRF                 *((volatile unsigned int*)(0x427060A8UL))
#define bFM3_MFS3_I2C_SSR_ORE                  *((volatile unsigned int*)(0x427060ACUL))
#define bFM3_MFS3_I2C_SSR_TBIE                 *((volatile unsigned int*)(0x427060B0UL))
#define bFM3_MFS3_I2C_SSR_DMA                  *((volatile unsigned int*)(0x427060B4UL))
#define bFM3_MFS3_I2C_SSR_TSET                 *((volatile unsigned int*)(0x427060B8UL))
#define bFM3_MFS3_I2C_SSR_REC                  *((volatile unsigned int*)(0x427060BCUL))
#define bFM3_MFS3_I2C_ISBA_SA0                 *((volatile unsigned int*)(0x42706200UL))
#define bFM3_MFS3_I2C_ISBA_SA1                 *((volatile unsigned int*)(0x42706204UL))
#define bFM3_MFS3_I2C_ISBA_SA2                 *((volatile unsigned int*)(0x42706208UL))
#define bFM3_MFS3_I2C_ISBA_SA3                 *((volatile unsigned int*)(0x4270620CUL))
#define bFM3_MFS3_I2C_ISBA_SA4                 *((volatile unsigned int*)(0x42706210UL))
#define bFM3_MFS3_I2C_ISBA_SA5                 *((volatile unsigned int*)(0x42706214UL))
#define bFM3_MFS3_I2C_ISBA_SA6                 *((volatile unsigned int*)(0x42706218UL))
#define bFM3_MFS3_I2C_ISBA_SAEN                *((volatile unsigned int*)(0x4270621CUL))
#define bFM3_MFS3_I2C_ISMK_SM0                 *((volatile unsigned int*)(0x42706220UL))
#define bFM3_MFS3_I2C_ISMK_SM1                 *((volatile unsigned int*)(0x42706224UL))
#define bFM3_MFS3_I2C_ISMK_SM2                 *((volatile unsigned int*)(0x42706228UL))
#define bFM3_MFS3_I2C_ISMK_SM3                 *((volatile unsigned int*)(0x4270622CUL))
#define bFM3_MFS3_I2C_ISMK_SM4                 *((volatile unsigned int*)(0x42706230UL))
#define bFM3_MFS3_I2C_ISMK_SM5                 *((volatile unsigned int*)(0x42706234UL))
#define bFM3_MFS3_I2C_ISMK_SM6                 *((volatile unsigned int*)(0x42706238UL))
#define bFM3_MFS3_I2C_ISMK_EN                  *((volatile unsigned int*)(0x4270623CUL))
#define bFM3_MFS3_I2C_FCR_FE1                  *((volatile unsigned int*)(0x42706280UL))
#define bFM3_MFS3_I2C_FCR_FE2                  *((volatile unsigned int*)(0x42706284UL))
#define bFM3_MFS3_I2C_FCR_FCL1                 *((volatile unsigned int*)(0x42706288UL))
#define bFM3_MFS3_I2C_FCR_FCL2                 *((volatile unsigned int*)(0x4270628CUL))
#define bFM3_MFS3_I2C_FCR_FSET                 *((volatile unsigned int*)(0x42706290UL))
#define bFM3_MFS3_I2C_FCR_FLD                  *((volatile unsigned int*)(0x42706294UL))
#define bFM3_MFS3_I2C_FCR_FLST                 *((volatile unsigned int*)(0x42706298UL))
#define bFM3_MFS3_I2C_FCR_FSEL                 *((volatile unsigned int*)(0x427062A0UL))
#define bFM3_MFS3_I2C_FCR_FTIE                 *((volatile unsigned int*)(0x427062A4UL))
#define bFM3_MFS3_I2C_FCR_FDRQ                 *((volatile unsigned int*)(0x427062A8UL))
#define bFM3_MFS3_I2C_FCR_FRIE                 *((volatile unsigned int*)(0x427062ACUL))
#define bFM3_MFS3_I2C_FCR_FLSTE                *((volatile unsigned int*)(0x427062B0UL))
#define bFM3_MFS3_I2C_FCR0_FE1                 *((volatile unsigned int*)(0x42706280UL))
#define bFM3_MFS3_I2C_FCR0_FE2                 *((volatile unsigned int*)(0x42706284UL))
#define bFM3_MFS3_I2C_FCR0_FCL1                *((volatile unsigned int*)(0x42706288UL))
#define bFM3_MFS3_I2C_FCR0_FCL2                *((volatile unsigned int*)(0x4270628CUL))
#define bFM3_MFS3_I2C_FCR0_FSET                *((volatile unsigned int*)(0x42706290UL))
#define bFM3_MFS3_I2C_FCR0_FLD                 *((volatile unsigned int*)(0x42706294UL))
#define bFM3_MFS3_I2C_FCR0_FLST                *((volatile unsigned int*)(0x42706298UL))
#define bFM3_MFS3_I2C_FCR1_FSEL                *((volatile unsigned int*)(0x427062A0UL))
#define bFM3_MFS3_I2C_FCR1_FTIE                *((volatile unsigned int*)(0x427062A4UL))
#define bFM3_MFS3_I2C_FCR1_FDRQ                *((volatile unsigned int*)(0x427062A8UL))
#define bFM3_MFS3_I2C_FCR1_FRIE                *((volatile unsigned int*)(0x427062ACUL))
#define bFM3_MFS3_I2C_FCR1_FLSTE               *((volatile unsigned int*)(0x427062B0UL))
#define bFM3_MFS3_I2C_FBYTE_FD0                *((volatile unsigned int*)(0x42706300UL))
#define bFM3_MFS3_I2C_FBYTE_FD1                *((volatile unsigned int*)(0x42706304UL))
#define bFM3_MFS3_I2C_FBYTE_FD2                *((volatile unsigned int*)(0x42706308UL))
#define bFM3_MFS3_I2C_FBYTE_FD3                *((volatile unsigned int*)(0x4270630CUL))
#define bFM3_MFS3_I2C_FBYTE_FD4                *((volatile unsigned int*)(0x42706310UL))
#define bFM3_MFS3_I2C_FBYTE_FD5                *((volatile unsigned int*)(0x42706314UL))
#define bFM3_MFS3_I2C_FBYTE_FD6                *((volatile unsigned int*)(0x42706318UL))
#define bFM3_MFS3_I2C_FBYTE_FD7                *((volatile unsigned int*)(0x4270631CUL))
#define bFM3_MFS3_I2C_FBYTE_FD8                *((volatile unsigned int*)(0x42706320UL))
#define bFM3_MFS3_I2C_FBYTE_FD9                *((volatile unsigned int*)(0x42706324UL))
#define bFM3_MFS3_I2C_FBYTE_FD10               *((volatile unsigned int*)(0x42706328UL))
#define bFM3_MFS3_I2C_FBYTE_FD11               *((volatile unsigned int*)(0x4270632CUL))
#define bFM3_MFS3_I2C_FBYTE_FD12               *((volatile unsigned int*)(0x42706330UL))
#define bFM3_MFS3_I2C_FBYTE_FD13               *((volatile unsigned int*)(0x42706334UL))
#define bFM3_MFS3_I2C_FBYTE_FD14               *((volatile unsigned int*)(0x42706338UL))
#define bFM3_MFS3_I2C_FBYTE_FD15               *((volatile unsigned int*)(0x4270633CUL))
#define bFM3_MFS3_I2C_FBYTE1_FD0               *((volatile unsigned int*)(0x42706300UL))
#define bFM3_MFS3_I2C_FBYTE1_FD1               *((volatile unsigned int*)(0x42706304UL))
#define bFM3_MFS3_I2C_FBYTE1_FD2               *((volatile unsigned int*)(0x42706308UL))
#define bFM3_MFS3_I2C_FBYTE1_FD3               *((volatile unsigned int*)(0x4270630CUL))
#define bFM3_MFS3_I2C_FBYTE1_FD4               *((volatile unsigned int*)(0x42706310UL))
#define bFM3_MFS3_I2C_FBYTE1_FD5               *((volatile unsigned int*)(0x42706314UL))
#define bFM3_MFS3_I2C_FBYTE1_FD6               *((volatile unsigned int*)(0x42706318UL))
#define bFM3_MFS3_I2C_FBYTE1_FD7               *((volatile unsigned int*)(0x4270631CUL))
#define bFM3_MFS3_I2C_FBYTE2_FD8               *((volatile unsigned int*)(0x42706320UL))
#define bFM3_MFS3_I2C_FBYTE2_FD9               *((volatile unsigned int*)(0x42706324UL))
#define bFM3_MFS3_I2C_FBYTE2_FD10              *((volatile unsigned int*)(0x42706328UL))
#define bFM3_MFS3_I2C_FBYTE2_FD11              *((volatile unsigned int*)(0x4270632CUL))
#define bFM3_MFS3_I2C_FBYTE2_FD12              *((volatile unsigned int*)(0x42706330UL))
#define bFM3_MFS3_I2C_FBYTE2_FD13              *((volatile unsigned int*)(0x42706334UL))
#define bFM3_MFS3_I2C_FBYTE2_FD14              *((volatile unsigned int*)(0x42706338UL))
#define bFM3_MFS3_I2C_FBYTE2_FD15              *((volatile unsigned int*)(0x4270633CUL))

/* UART asynchronous channel 5 registers */
#define bFM3_MFS5_UART_SMR_SOE                 *((volatile unsigned int*)(0x4270A000UL))
#define bFM3_MFS5_UART_SMR_BDS                 *((volatile unsigned int*)(0x4270A008UL))
#define bFM3_MFS5_UART_SMR_SBL                 *((volatile unsigned int*)(0x4270A00CUL))
#define bFM3_MFS5_UART_SMR_WUCR                *((volatile unsigned int*)(0x4270A010UL))
#define bFM3_MFS5_UART_SCR_TXE                 *((volatile unsigned int*)(0x4270A020UL))
#define bFM3_MFS5_UART_SCR_RXE                 *((volatile unsigned int*)(0x4270A024UL))
#define bFM3_MFS5_UART_SCR_TBIE                *((volatile unsigned int*)(0x4270A028UL))
#define bFM3_MFS5_UART_SCR_TIE                 *((volatile unsigned int*)(0x4270A02CUL))
#define bFM3_MFS5_UART_SCR_RIE                 *((volatile unsigned int*)(0x4270A030UL))
#define bFM3_MFS5_UART_SCR_UPCL                *((volatile unsigned int*)(0x4270A03CUL))
#define bFM3_MFS5_UART_ESCR_L0                 *((volatile unsigned int*)(0x4270A080UL))
#define bFM3_MFS5_UART_ESCR_L1                 *((volatile unsigned int*)(0x4270A084UL))
#define bFM3_MFS5_UART_ESCR_L2                 *((volatile unsigned int*)(0x4270A088UL))
#define bFM3_MFS5_UART_ESCR_P                  *((volatile unsigned int*)(0x4270A08CUL))
#define bFM3_MFS5_UART_ESCR_PEN                *((volatile unsigned int*)(0x4270A090UL))
#define bFM3_MFS5_UART_ESCR_INV                *((volatile unsigned int*)(0x4270A094UL))
#define bFM3_MFS5_UART_ESCR_ESBL               *((volatile unsigned int*)(0x4270A098UL))
#define bFM3_MFS5_UART_ESCR_FLWEN              *((volatile unsigned int*)(0x4270A09CUL))
#define bFM3_MFS5_UART_SSR_TBI                 *((volatile unsigned int*)(0x4270A0A0UL))
#define bFM3_MFS5_UART_SSR_TDRE                *((volatile unsigned int*)(0x4270A0A4UL))
#define bFM3_MFS5_UART_SSR_RDRF                *((volatile unsigned int*)(0x4270A0A8UL))
#define bFM3_MFS5_UART_SSR_ORE                 *((volatile unsigned int*)(0x4270A0ACUL))
#define bFM3_MFS5_UART_SSR_FRE                 *((volatile unsigned int*)(0x4270A0B0UL))
#define bFM3_MFS5_UART_SSR_PE                  *((volatile unsigned int*)(0x4270A0B4UL))
#define bFM3_MFS5_UART_SSR_REC                 *((volatile unsigned int*)(0x4270A0BCUL))
#define bFM3_MFS5_UART_RDR_AD                  *((volatile unsigned int*)(0x4270A120UL))
#define bFM3_MFS5_UART_TDR_AD                  *((volatile unsigned int*)(0x4270A120UL))
#define bFM3_MFS5_UART_BGR_EXT                 *((volatile unsigned int*)(0x4270A1BCUL))
#define bFM3_MFS5_UART_BGR1_EXT                *((volatile unsigned int*)(0x4270A1BCUL))
#define bFM3_MFS5_UART_FCR_FE1                 *((volatile unsigned int*)(0x4270A280UL))
#define bFM3_MFS5_UART_FCR_FE2                 *((volatile unsigned int*)(0x4270A284UL))
#define bFM3_MFS5_UART_FCR_FCL1                *((volatile unsigned int*)(0x4270A288UL))
#define bFM3_MFS5_UART_FCR_FCL2                *((volatile unsigned int*)(0x4270A28CUL))
#define bFM3_MFS5_UART_FCR_FSET                *((volatile unsigned int*)(0x4270A290UL))
#define bFM3_MFS5_UART_FCR_FLD                 *((volatile unsigned int*)(0x4270A294UL))
#define bFM3_MFS5_UART_FCR_FLST                *((volatile unsigned int*)(0x4270A298UL))
#define bFM3_MFS5_UART_FCR_FSEL                *((volatile unsigned int*)(0x4270A2A0UL))
#define bFM3_MFS5_UART_FCR_FTIE                *((volatile unsigned int*)(0x4270A2A4UL))
#define bFM3_MFS5_UART_FCR_FDRQ                *((volatile unsigned int*)(0x4270A2A8UL))
#define bFM3_MFS5_UART_FCR_FRIE                *((volatile unsigned int*)(0x4270A2ACUL))
#define bFM3_MFS5_UART_FCR_FLSTE               *((volatile unsigned int*)(0x4270A2B0UL))
#define bFM3_MFS5_UART_FCR0_FE1                *((volatile unsigned int*)(0x4270A280UL))
#define bFM3_MFS5_UART_FCR0_FE2                *((volatile unsigned int*)(0x4270A284UL))
#define bFM3_MFS5_UART_FCR0_FCL1               *((volatile unsigned int*)(0x4270A288UL))
#define bFM3_MFS5_UART_FCR0_FCL2               *((volatile unsigned int*)(0x4270A28CUL))
#define bFM3_MFS5_UART_FCR0_FSET               *((volatile unsigned int*)(0x4270A290UL))
#define bFM3_MFS5_UART_FCR0_FLD                *((volatile unsigned int*)(0x4270A294UL))
#define bFM3_MFS5_UART_FCR0_FLST               *((volatile unsigned int*)(0x4270A298UL))
#define bFM3_MFS5_UART_FCR1_FSEL               *((volatile unsigned int*)(0x4270A2A0UL))
#define bFM3_MFS5_UART_FCR1_FTIE               *((volatile unsigned int*)(0x4270A2A4UL))
#define bFM3_MFS5_UART_FCR1_FDRQ               *((volatile unsigned int*)(0x4270A2A8UL))
#define bFM3_MFS5_UART_FCR1_FRIE               *((volatile unsigned int*)(0x4270A2ACUL))
#define bFM3_MFS5_UART_FCR1_FLSTE              *((volatile unsigned int*)(0x4270A2B0UL))
#define bFM3_MFS5_UART_FBYTE_FD0               *((volatile unsigned int*)(0x4270A300UL))
#define bFM3_MFS5_UART_FBYTE_FD1               *((volatile unsigned int*)(0x4270A304UL))
#define bFM3_MFS5_UART_FBYTE_FD2               *((volatile unsigned int*)(0x4270A308UL))
#define bFM3_MFS5_UART_FBYTE_FD3               *((volatile unsigned int*)(0x4270A30CUL))
#define bFM3_MFS5_UART_FBYTE_FD4               *((volatile unsigned int*)(0x4270A310UL))
#define bFM3_MFS5_UART_FBYTE_FD5               *((volatile unsigned int*)(0x4270A314UL))
#define bFM3_MFS5_UART_FBYTE_FD6               *((volatile unsigned int*)(0x4270A318UL))
#define bFM3_MFS5_UART_FBYTE_FD7               *((volatile unsigned int*)(0x4270A31CUL))
#define bFM3_MFS5_UART_FBYTE_FD8               *((volatile unsigned int*)(0x4270A320UL))
#define bFM3_MFS5_UART_FBYTE_FD9               *((volatile unsigned int*)(0x4270A324UL))
#define bFM3_MFS5_UART_FBYTE_FD10              *((volatile unsigned int*)(0x4270A328UL))
#define bFM3_MFS5_UART_FBYTE_FD11              *((volatile unsigned int*)(0x4270A32CUL))
#define bFM3_MFS5_UART_FBYTE_FD12              *((volatile unsigned int*)(0x4270A330UL))
#define bFM3_MFS5_UART_FBYTE_FD13              *((volatile unsigned int*)(0x4270A334UL))
#define bFM3_MFS5_UART_FBYTE_FD14              *((volatile unsigned int*)(0x4270A338UL))
#define bFM3_MFS5_UART_FBYTE_FD15              *((volatile unsigned int*)(0x4270A33CUL))
#define bFM3_MFS5_UART_FBYTE1_FD0              *((volatile unsigned int*)(0x4270A300UL))
#define bFM3_MFS5_UART_FBYTE1_FD1              *((volatile unsigned int*)(0x4270A304UL))
#define bFM3_MFS5_UART_FBYTE1_FD2              *((volatile unsigned int*)(0x4270A308UL))
#define bFM3_MFS5_UART_FBYTE1_FD3              *((volatile unsigned int*)(0x4270A30CUL))
#define bFM3_MFS5_UART_FBYTE1_FD4              *((volatile unsigned int*)(0x4270A310UL))
#define bFM3_MFS5_UART_FBYTE1_FD5              *((volatile unsigned int*)(0x4270A314UL))
#define bFM3_MFS5_UART_FBYTE1_FD6              *((volatile unsigned int*)(0x4270A318UL))
#define bFM3_MFS5_UART_FBYTE1_FD7              *((volatile unsigned int*)(0x4270A31CUL))
#define bFM3_MFS5_UART_FBYTE2_FD8              *((volatile unsigned int*)(0x4270A320UL))
#define bFM3_MFS5_UART_FBYTE2_FD9              *((volatile unsigned int*)(0x4270A324UL))
#define bFM3_MFS5_UART_FBYTE2_FD10             *((volatile unsigned int*)(0x4270A328UL))
#define bFM3_MFS5_UART_FBYTE2_FD11             *((volatile unsigned int*)(0x4270A32CUL))
#define bFM3_MFS5_UART_FBYTE2_FD12             *((volatile unsigned int*)(0x4270A330UL))
#define bFM3_MFS5_UART_FBYTE2_FD13             *((volatile unsigned int*)(0x4270A334UL))
#define bFM3_MFS5_UART_FBYTE2_FD14             *((volatile unsigned int*)(0x4270A338UL))
#define bFM3_MFS5_UART_FBYTE2_FD15             *((volatile unsigned int*)(0x4270A33CUL))

